erpdev.СХК_Расширение/src/DataProcessors/СХК_МобильныйСклад/СХК_МобильныйСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СХК_МобильныйСклад</name>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

erpdev.СХК_Расширение/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe779ac1-0e7f-489c-ad06-bec9af582428">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d561ee5a-2a87-4205-93af-4902b1247d87">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="c79450ab-f8f1-43d9-948d-10c6481c5538">
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="93716140-4123-4913-8258-75356dec29a0">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="75e2d606-c8d4-4cfe-8f96-2eaa5c364409">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

erpdev.СХК_Расширение/src/DataProcessors/СХК_МобильныйСклад/Forms/ФормаСканШК/Module.bsl
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	СтуктураВозврат = Новый Структура;
	СтуктураВозврат.Вставить("Ош",ЭтаФорма.Ош);
	СтуктураВозврат.Вставить("Ошибка",ЭтаФорма.Ошибка);
	СтуктураВозврат.Вставить("Серия",ЭтаФорма.Серия);
	СтуктураВозврат.Вставить("Штр",ЭтаФорма.СканШК);
	//СтуктураВозврат.Вставить("СерияНоменклатуры",ЭтаФорма.СерияНоменклатуры);
	//СтуктураВозврат.Вставить("Количество",ЭтаФорма.Количество);
	//СтуктураВозврат.Вставить("ТипНоменклатуры",ЭтаФорма.ТипНоменклатуры);
	ОповеститьОВыборе(СтуктураВозврат); 

КонецПроцедуры

&НаКлиенте
Процедура СканШКИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	инфШк = НайтиШКСервер(Текст);
	Если инфШк = 1 Тогда
		ЭтаФорма.СканШК = Текст; 
		ЭтаФорма.Ош = Истина;
	Иначе
		ЭтаФорма.Ош = Ложь;
		ЭтаФорма.Ошибка = инфШк; 
	КонецЕсли;

	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Функция НайтиШКСервер(ШК)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	ШтрихкодыНоменклатуры.Номенклатура = &Номенклатура
	               |	И ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод";
	
 	Запрос.УстановитьПараметр("Номенклатура",ЭтаФорма.Номенклатура);
	Запрос.УстановитьПараметр("Штрихкод",ШК);

	Рез = Запрос.Выполнить().Выбрать();
	
	Если Рез.Следующий() Тогда 
		Ош = 1;
	Иначе  
		
		НоменклатураСпаек = СХК_ТСДСклад.ЗаполнитьУпаковкаУп(ШК,ЭтаФорма.Номенклатура); 
		
		Если НоменклатураСпаек = Неопределено Тогда
			Ош = "Код не найден";	
		Иначе  
			Ош = 1;
		КонецЕсли;  
		
	КонецЕсли;
	
	Возврат Ош;
	
КонецФункции 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	//ЗаполнитьИнформацию(СтруктураПараметров.Штрих,СтруктураПараметров.Серия,СтруктураПараметров.Номенклатура,СтруктураПараметров.Ячейка);
	Если СтруктураПараметров.Серия <> "" Тогда
		ЭтаФорма.Серия = СтруктураПараметров.Серия;
		ЭтаФорма.Номенклатура = СтруктураПараметров.Номенклатура;
	КонецЕсли;
	
	//Если СтруктураПараметров.Ссылка <> "" Тогда
	//	ЗаполнитьИнформацию(СтруктураПараметров.НомерСтроки,СтруктураПараметров.Ссылка);
	//Иначе
	//	Сообщить("Не удалось создать документ отгрузки");	
	//КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.Элементы.СканШК.РедактированиеТекста = Истина;
	АктивироватьПоиск();

КонецПроцедуры 

&НаКлиенте
Процедура АктивироватьПоиск() 
	ОчиститьШКСервер(); 
	Элементы.СканШК.ОбновитьТекстРедактирования();
	Элементы.СканШК.Видимость = Ложь;
	Элементы.СканШК.Видимость = Истина;
	ЭтаФорма.ТекущийЭлемент = Элементы.СканШК; 
	# Если МобильныйКлиент Тогда
		НачатьРедактированиеЭлемента();
	#КонецЕсли
	
КонецПроцедуры   

&НаСервере
Процедура ОчиститьШКСервер()
	СканШК = "";
КонецПроцедуры
